---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ScheduleDefinition..::..GetField Method
ScheduleDefinition Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | GetField(Int32) | Gets a field. |
|  | GetField(ScheduleFieldId) | Gets a field. |

# See Also

ScheduleDefinition Class

ScheduleDefinition Members

Autodesk.Revit.DB Namespace